<a href="https://colab.research.google.com/github/Aldistwn29/data-science-newbe/blob/main/Latihanipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Latihan**

  - **Library**

In [ ]:
import numpy as np # Library untuk matematika
import pandas as pd # Library untuk datframe
import seaborn as sns # Library untuk visualisasi
import matplotlib.pyplot as plt

**Load Data**

In [ ]:
dataset = sns.load_dataset("titanic")

*Memahami data*

In [ ]:
# melihat 5 data pertama untuk melihat gambaran data yg dimiliki
dataset.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# Melihat informasi tipe data, missing values (data hilang), memori, banyak data
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

**Data Kategori**

**Nominal**
* Binary

1. sex
2. survival -> alive
3. adult_male
4. alone

* Multi

1. embarl -> embark_town

**Ordinal**

1. pclass->class

**Data Numerik**

1. age
2. sibsp
3. parch